#### terraform plan every: 5be409d
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.cert.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/f1c36295-d8df-4b2d-8299-8bef76319916]
module.cert.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.cert.aws_acm_certificate_validation.main: Refreshing state... [id=2021-05-13 11:49:43 +0000 UTC]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0001d87961a570268]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0cf0a00de04475799]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-06e85ec849b89819b]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-09b584e764d0f51ca]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-03f4cbdd4a64f5fcc]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-04804371ae1f9809c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-074c62c425598a42d]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-018065a63b6130bfe]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-0e5e70615e443fbd1]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-059083d65d7027ce5]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-050f9b0e3625385e3]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-074c62c425598a42d1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ec21ba1ee922076b]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0565c85b8066041f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-037c6c791a364fa78]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-07fff2cedc144b0a2]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-087ac8a98fd3c4f44]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-080717701ab704511]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cert.aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "line-bot-sample2.moikilo00.net"
      + domain_validation_options = [
          + {
              + domain_name           = "line-bot-sample2.moikilo00.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.cert.aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cert.aws_route53_record.validations["line-bot-sample2.moikilo00.net"] must be replaced
-/+ resource "aws_route53_record" "validations" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net" -> (known after apply)
      ~ id              = "Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME" -> (known after apply)
      ~ name            = "_9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net" -> (known after apply) # forces replacement
      ~ records         = [
          - "_0d9444c4c345477db079eafb8e974446.bbfvkzsszw.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*